{
"aboutMe": {
  "title": "About Me",
  "descriptionStart": "Hello! My name is",
  "name": "Kamil Lukas Gorny",
  "descriptionMiddle": "and I am a technology enthusiast combining interests in cybersecurity, low-level programming, artificial intelligence (including LLM models), and reverse engineering. I am currently studying mathematics at the R2 level to prepare for",
  "computerScience": "data science",
  "pagePurpose": "This website is a collection of information I have gathered on topics that interest me. It also demonstrates my knowledge of JavaScript and React, as I built it from scratch without using templates.",
  "coursesTitle": "Courses I Have Completed",
  "courses": {
    "powershellBeginner": "PowerShell Beginner Tutorial – Complete Course – 6 hours online",
    "powershellBeginnerLink": "https://www.youtube.com/watch?v=LVuI9d-k9C6A",
    "powershellIntermediate": "PowerShell: From Beginner to Script Developer – 11 hours online",
    "powershellIntermediateLink": "https://www.udemy.com/certificate/UC-10b08877-27be-4fe1-b7d5-8cc3c51ebf4a/",
    "powershellAdvanced": "PowerShell Advanced",
    "powershellAdvancedLink": "https://www.udemy.com/certificate/UC-3d2f6b06-b10d-4e9a-acf8-fdf9ca116538/",
    "comptia": "CompTIA A+ – Complete Course – 31 hours online",
    "comptiaLink": "https://www.youtube.com/watch?v=IC7XXNKJAYs",
    "pythonBootcamp": "100 Days of Code: The Complete Python Bootcamp – 58 hours online",
    "pythonBootcampLink": "https://www.udemy.com/course/100-days-of-code/learn/lecture/23154980#overview",
    "cybersecurity1": "The Complete Cybersecurity Course | V1",
    "cybersecurity1Details": "Certificate: Nathan House BSc. Certificate Number 1-2875424334",
    "cybersecurity1Link": "https://funkweb.udemy.com/certificate/UC-009f971d-6af6-471d-85b5-54329e501f06/",
    "cybersecurity2": "The Complete Cybersecurity Course | V2",
    "cybersecurity2Details": "Certificate: Nathan House BSc. Certificate Number 2-2875424334",
    "cybersecurity2Link": "https://funkweb.udemy.com/certificate/UC-1e406f53-825a-499b-a430-7c40b6025399/",
    "linux": "Linux for Beginners",
    "linuxLink": "https://www.udemy.com/certificate/UC-b7808161-a224-42ac-a91d-93917d5caeb/",
    "javascriptExpert": "The Complete JavaScript Course 2024: From Beginner to Expert! – 68.5 hours total",
    "javascriptExpertLink": "https://funkweb.udemy.com/certificate/UC-7945af24-5b63-4bc2-94d7-807eecaee128/",
    "reactCourse": "React.js from scratch! Learn React, Hooks, Redux, React Router, Next.js",
    "reactCourseLink": "https://funkweb.udemy.com/certificate/UC-ff00381b-26fe-49e1-94f5-80f08bbc31ed/",
    "viewCourseLink": "View Course",
    "viewCertificateLink": "View Certificate"
  },
  "beyondTechnologyTitle": "Beyond Technology",
  "beyondTechnologyDescription": "Outside of technology, I enjoy spending my time actively. Snowboarding and mountain hiking are my favorite ways to relax and recharge. In my free time, I like reading books or exploring the world around me, drawing inspiration from every experience."
},
  

  "header": {
    "title": "Zer0-Day Guardian",
    "menu1": "☰ Science and Technology ",
    "menu2": "☰ Future and Innovations ",
    "aboutMeLink": "About Me"
  },
  "menu1": {
    "algorithms": "Algorithms",
    "programming": "Programming",
    "geometryAnalysis": "Geometry and Mathematical Analysis",
    "cybersecurity": "Cybersecurity",
    "hardwareEngineering": "Hardware and Reverse Engineering"
  },
  "menu2": {
    "artificialIntelligence": "Artificial Intelligence",
    "hacking": "Hacking",
    "apis": "APIs",
    "blockchainCrypto": "Blockchain and Crypto",
    "quantumComputing": "Quantum Computing",
    "industry4IoT": "Industry 4.0 and IoT"
  },
  "body": {
    "science": "Science",
    "scienceDescription": "Exploration of knowledge and discoveries",
    "technology": "Technology",
    "technologyDescription": "Innovative technological solutions",
    "future": "Future",
    "futureDescription": "Modern approach to development",
    "innovation": "Innovation",
    "innovationDescription": "Pioneering ideas shaping the world"
  },
  "article": {
    "author": "Author",
    "date": "Date"
  },
  "articles": {
    "1": {
      "category": "Industry 4.0 and IoT",
      "subcategory": "Innovation",
      "title": "Industry 4.0 and IoT in 2025: Revolution in Industry and Everyday Life",
      "content": "<h2>Industry 4.0 and IoT...</h2>",
      "image": "/images/articles/article1.png",
      "author": "N00b0dy",
      "date": "2025-01-11"
    },
    "2": {
      "category": "Quantum Computing",
      "subcategory": "Innovation",
      "title": "Quantum Computers: The Technological Revolution of the Future",
      "content": "<h2>Quantum Computers: The Technological Revolution of the Future</h2><p>Quantum computers...</p>",
      "image": "/images/articles/Quantum_Computers_The_Technological_Revolution_of_the_Future.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    },
    "3": {
      "category": "Cybersecurity",
      "subcategory": "Science",
      "title": "Backdoor in XZ Utils: New Discoveries and Technical Analysis",
      "content": "<h2>Backdoor in XZ Utils</h2><p>Discover the advanced techniques behind the XZ Utils backdoor and its impact on open-source security.</p>",
      "image": "/images/articles/Backdoor_in_XZ_Utils_New_Discoveries_and_Technical_Analysis.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    },
    "4": {
      "category": "Algorithms",
      "subcategory": "Science",
      "title": "AES256: Basics, History, and Significance in Cybersecurity",
      "content": "<h2>AES256: Basics, History, and Significance in Cybersecurity</h2><p>A comprehensive look at AES256, its development, and its critical role in modern cybersecurity.</p>",
      "image": "/images/articles/AES256_Basics_History_and_Significance_in_Cybersecurity.webp",
      "author": "N00b0dy",
      "date": "2025-01-14"
    },
    "5": {
      "category": "Geometry and Mathematical Analysis",
      "subcategory": "Science",
      "title": "New Geometry: How the 'Einstein' Shape Creates a Never-Repeating Pattern",
      "content": "The 'Einstein' shape is a breakthrough in mathematics that allows the plane to be covered with an infinite, non-repeating pattern.",
      "image": "/images/articles/einstein.png",
      "author": "N00b0dy",
      "date": "2025-01-15"
    },
    "6": {
      "category": "Hacking",
      "subcategory": "Future",
      "title": "Massive VPN Password Leak on the Dark Web",
      "content": "lalalal",
      "image": "/images/articles/einstein.png",
      "author": "N00b0dy",
      "date": "2025-01-22"
    },

    "map": {
      "silicon_valley": "Silicon Valley",
      "silicon_valley_description": "Silicon Valley, located in California, USA, is the global hub for technological innovation. It is home to leading companies driving advancements in artificial intelligence, software development, and modern gadgets.",
      "shenzhen": "Shenzhen, China",
      "shenzhen_description": "Shenzhen, situated in southern China, is known as the world leader in IoT device manufacturing. The city is renowned for its tech parks and vibrant ecosystem supporting startups and tech giants.",
      "helsinki": "Helsinki, Finland",
      "helsinki_description": "Helsinki is one of Europe's top centers for cybersecurity. The city attracts experts and researchers focused on data protection, playing a pivotal role in ensuring digital security.",
      "warsaw": "Warsaw, Poland",
      "warsaw_description": "5 out of 7 leading researchers working on the o1 model are Polish, showcasing the significant contribution of Poles to global AI development. Warsaw is a key hub for science and technology, fostering innovation and progress.",
      "cambridge": "Cambridge, United Kingdom",
      "cambridge_description": "Cambridge, known for its prestigious university, is regarded as the birthplace of computer science and theoretical mathematics. Alan Turing, who laid the foundations of modern computing, worked here.",
      "reykjavik": "Reykjavik, Iceland",
      "reykjavik_description": "Reykjavik is a leader in the use of renewable energy. Most data centers in Iceland are powered by geothermal and hydroelectric energy, making them environmentally sustainable.",
      "tel_aviv": "Tel Aviv, Israel",
      "tel_aviv_description": "Tel Aviv is a global hub for innovation and startups, especially in the field of cybersecurity. The city hosts companies developing advanced technologies for data protection and cyber defense.",
      "bangalore": "Bangalore, India",
      "bangalore_description": "Bangalore, often referred to as the Silicon Valley of India, is a major center for software development and technology. The city attracts talented engineers and developers from around the world.",
      "toronto": "Toronto, Canada",
      "toronto_description": "Toronto is home to Citizen Lab, a research center that investigates threats to human rights in the digital age. The city is also a leading hub for artificial intelligence and cutting-edge technologies.",
      "svalbard": "Svalbard, Norway",
      "svalbard_description": "Svalbard, an archipelago situated in the Arctic Ocean, is home to the Global Seed Vaul",
      "norway": "Norway",
      "norway_description": "Norway is a global leader in recycling plastic bottles, achieving a 97% recycling rate through its innovative panteordning system. This advanced technology not only reduces plastic waste but also sets an example for sustainable practices worldwide.",
      "cape_town": "Cape Town, South Africa",
      "cape_town_description": "Cape Town is not only a famous tourist destination but also a hub of technological innovation on the African continent. The city is home to numerous tech start-ups working on solutions in renewable energy and digital agriculture.",
      "kigali": "Kigali, Rwanda",
      "kigali_description": "Kigali is known as the 'Singapore of Africa' due to its modern approach to urban planning and technology. The city has implemented waste management systems and advanced public transportation technologies such as electric motorcycle taxis.",
      "nairobi": "Nairobi, Kenya",
      "nairobi_description": "Nairobi, known as 'Silicon Savannah,' is a fintech hub in Africa. The city pioneered the introduction of mobile payment systems like M-Pesa, revolutionizing financial management in the region."
    },




  "privacyPolicy": {
    "title": "Privacy Policy",
    "introduction": "Your privacy is important to us. This privacy policy explains how we collect, use, and protect your personal data when you use our services. By accessing or using our website and services, you agree to the collection and use of information in accordance with this policy.",
    "dataCollection": {
      "title": "Data Collection",
      "description": "We collect personal data in various ways, including through forms you submit, cookies, and usage tracking. The types of personal data we collect may include your name, email address, phone number, IP address, and information about your usage of our website.",
      "methods": {
        "forms": "We collect data that you provide directly to us through forms on our website.",
        "cookies": "Cookies are small files stored on your device that help us track your preferences and usage patterns.",
        "usageTracking": "We collect information about how you use our website, such as the pages you visit, the time spent on each page, and the links you click."
      }
    },
    "dataUsage": {
      "title": "Data Usage",
      "description": "We use your personal data for the following purposes: to provide and improve our services, communicate with you about your account or updates to our services, personalize your experience, analyze trends, and monitor the effectiveness of our website.",
      "purposes": {
        "serviceProvision": "We use your data to deliver the services you request and to ensure that our website functions properly.",
        "communication": "We may contact you with updates, offers, or important information related to our services.",
        "personalization": "We may personalize content, advertisements, and user experience based on your preferences and usage patterns.",
        "analytics": "We analyze the data to better understand user behavior and improve our website and services."
      }
    },
    "dataProtection": {
      "title": "Data Protection",
      "description": "We are committed to protecting your personal data. We implement industry-standard security measures to safeguard your information from unauthorized access, alteration, disclosure, or destruction. These measures include encryption, firewalls, and secure server infrastructure.",
      "securityMeasures": {
        "encryption": "All sensitive information is transmitted securely using encryption protocols such as SSL/TLS.",
        "accessControl": "We limit access to your personal data to authorized personnel only, and ensure that they are trained on the importance of data security.",
        "dataRetention": "We retain your personal data only as long as necessary for the purposes outlined in this policy, after which it will be securely deleted or anonymized."
      }
    },
    "cookies": {
      "title": "Cookies",
      "description": "We use cookies to enhance your user experience, analyze site usage, and provide personalized content. Cookies are small text files that are placed on your device to track your preferences and usage. You can control and manage cookies through your browser settings, including blocking or deleting them.",
      "types": {
        "essential": "These cookies are necessary for the website to function properly and cannot be disabled.",
        "performance": "These cookies help us understand how visitors use our website, enabling us to improve functionality and user experience.",
        "advertising": "These cookies track your browsing habits and may be used to display personalized ads based on your interests."
      }
    },
    "userRights": {
      "title": "User Rights",
      "description": "You have certain rights regarding your personal data. You can access, update, or delete your personal data at any time. You also have the right to object to or restrict certain processing activities, as well as the right to data portability.",
      "rights": {
        "access": "You can request a copy of the personal data we hold about you.",
        "correction": "You can correct any inaccurate or incomplete personal data we hold about you.",
        "deletion": "You can request that we delete your personal data, subject to certain legal limitations.",
        "restriction": "You can request that we limit the processing of your personal data under certain circumstances.",
        "portability": "You can request that we transfer your personal data to another organization, in a structured, commonly used, and machine-readable format."
      },
      "howToExerciseRights": "To exercise any of these rights, please contact us at [email address] or through the contact form on our website."
    },
    "thirdPartySharing": {
      "title": "Sharing with Third Parties",
      "description": "We do not sell or share your personal data with third parties for their own marketing purposes. However, we may share your data with trusted third-party service providers who assist us in operating our website, conducting business, or servicing you, under strict confidentiality agreements. We may also disclose your data if required by law or in response to legal requests."
    },
    "dataTransfers": {
      "title": "Data Transfers",
      "description": "Your personal data may be transferred to and maintained on computers located outside your country of residence, where the data protection laws may differ. By using our services, you consent to the transfer of your data to countries that may not provide the same level of protection as your home country."
    },
    "changes": {
      "title": "Changes to Policy",
      "description": "We may update this privacy policy from time to time. Any changes will be posted on this page, and the updated policy will be effective as soon as it is published. We recommend that you review this policy periodically to stay informed about how we are protecting your data."
    },
    "contact": {
      "title": "Contact Us",
      "description": "If you have any questions about this privacy policy or our data practices, please contact us at zerodayguardian@proton.me."
    }
  },
"recommendedTools": {
    "title": "Recommended Tools and Websites",
    "tools": {
      "chatgpt": {
        "name": "ChatGPT",
        "description": "Advanced AI model for text generation and coding assistance.",
        "price": "Free / Plus: $20/month"
      },
      "githubCopilot": {
        "name": "GitHub Copilot",
        "description": "AI-powered coding assistant from OpenAI.",
        "price": "$10/month for individual users"
      },
      "figma": {
        "name": "Figma",
        "description": "Tool for UI/UX design and prototyping.",
        "price": "Free / Pro: $12/month"
      },
      "canva": {
        "name": "Canva",
        "description": "Easy-to-use graphic design tool.",
        "price": "Free / Pro: $12.99/month"
      },
      "mdnFigure": {
        "name": "MDN Figure Element",
        "description": "Documentation for the HTML  elements.",
        "price": "Free"
      },
      "deWatermark": {
        "name": "DeWatermark AI",
        "description": "AI-powered watermark remover.",
        "price": "Free / Premium"
      },
      "tinypng": {
        "name": "TinyPNG",
        "description": "PNG and JPEG image compression tool.",
        "price": "Free / Pro: $25/year"
      },
      "ezgif": {
        "name": "Ezgif",
        "description": "GIF editor for cropping, resizing, optimizing, and converting files.",
        "price": "Free"
      },
      "webaim": {
        "name": "WebAIM Contrast Checker",
        "description": "Tool for checking color contrast according to WCAG.",
        "price": "Free"
      },
      "uigoodies": {
        "name": "UI Goodies",
        "description": "Collection of UI/UX resources such as color palettes, icons, and tools.",
        "price": "Free"
      },
      "imagetotext": {
        "name": "Image to Text",
        "description": "OCR technology to convert images to text.",
        "price": "Free"
      },
      "coolors": {
        "name": "Coolors",
        "description": "Fast and easy color palette generator for designers and artists.",
        "price": "Free / Pro: $5/month"
      },
      "htmlColorCodes": {
        "name": "HTML Color Codes",
        "description": "Comprehensive tool for finding and converting HTML color codes.",
        "price": "Free"
      },
      "pdf2docx": {
        "name": "PDF2DOCX",
        "description": "Online converter for transforming PDFs into editable DOCX files.",
        "price": "Free / Premium"
      },
      "smodin": {
        "name": "Smodin",
        "description": "AI-powered paraphrasing and text generation tool.",
        "price": "Free / Pro: Various plans"
      },
      "patorjk": {
        "name": "Patorjk",
        "description": "ASCII text generator and various online developer tools.",
        "price": "Free"
      },
      "deepseek": {
        "name": "Deepseek",
        "description": "An advanced tool for searching and analyzing data online.",
        "price": "Free / Pro: $15/month"
      },
      "vercelHosting": {
        "name": "Vercel Hosting",
        "description": "Modern cloud hosting for front-end applications.",
        "price": "Free / Pro: from $20/month"
      }
    }
  }
}
}
