{
  "header": {
    "title": "Zer0-Day Guardian",
    "menu1": "☰ Science and Technology",
    "menu2": "☰ Future and Innovation",
    "aboutMeLink": "About Me"
  },
  "menu1": {
    "algorithms": "Algorithms",
    "programming": "Programming",
    "geometryAnalysis": "Geometry and Mathematical Analysis",
    "cybersecurity": "Cybersecurity",
    "hardwareEngineering": "Hardware Engineering and Reverse Engineering"
  },
  "menu2": {
    "artificialIntelligence": "Artificial Intelligence",
    "hacking": "Hacking",
    "apis": "APIs",
    "blockchainCrypto": "Blockchain and Cryptocurrency",
    "quantumComputing": "Quantum Computing",
    "industry4IoT": "Industry 4.0 and IoT"
  },
  "body": {
    "science": "Science",
    "scienceDescription": "Exploration of knowledge and discoveries",
    "technology": "Technology",
    "technologyDescription": "Innovative technological solutions",
    "future": "Future",
    "futureDescription": "A modern approach to development",
    "innovation": "Innovation",
    "innovationDescription": "Pioneering ideas changing the world"
  },
  "article": {
    "author": "Author",
    "date": "Date"
  },
  "articles": {
    "1": {
      "category": "Industry 4.0 and IoT",
      "subcategory": "Future",
      "title": "Industry 4.0 and IoT in 2025: Revolution in Industry and Everyday Life",
      "content": "<h2>Industry 4.0 and IoT...</h2>",
      "image": "/images/articles/article1.png",
      "author": "N00b0dy",
      "date": "2025-01-11"
    },
    "2": {
      "category": "Quantum Computing",
      "subcategory": "Innovation",
      "title": "Quantum Computers: The Technological Revolution of the Future",
      "content": "<h2>Quantum Computers: The Technological Revolution of the Future</h2><p>Quantum computers...</p>",
      "image": "/images/articles/Quantum_Computers_The_Technological_Revolution_of_the_Future.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    }
  },
  "3": {
    "category": "Cybersecurity",
    "subcategory": "Science",
    "title": "Backdoor in XZ Utils: New Discoveries and Technical Analysis",
    "content": "Discover the advanced techniques used in the XZ Utils backdoor and its impact on open-source security.",
    "image": "/images/articles/Backdoor_in_XZ_Utils.png",
    "author": "N00b0dy",
    "date": "2025-01-13"
  },
  "4": {
    "category": "Algorithms",
    "subcategory": "Science",
    "title": "AES256: Basics, History and Significance in Cybersecurity",
    "content": "AES256: Basics, History and Significance in Cybersecurity",
    "image": "/images/articles/AES256.png",
    "author": "N00b0dy",
    "date": "2025-01-14"
  },
  "5": {
    "category": "Geometry and Mathematical Analysis",
    "subcategory": "Science",
    "title": "New Geometry: How the 'Einstein' Shape Creates a Never-Repeating Pattern",
    "content": "The 'Einstein' shape is a breakthrough in mathematics that allows the plane to be covered with an infinite, non-repeating pattern.",
    "image": "/images/articles/einstein.png",
    "author": "N00b0dy",
    "date": "2025-01-15"
  },
  "6": {
    "category": "Hacking",
    "subcategory": "Technology",
    "title": "Massive VPN Password Leak on the Dark Web",
    "content": "<h2>Massive VPN password leak on the darknet: a global threat</h2>",
    "image": "/images/articles/einstein.png",
    "author": "N00b0dy",
    "date": "2025-01-22"
  },
  "map": {
    "silicon_valley": "Silicon Valley",
    "silicon_valley_description": "Silicon Valley in California, USA, is the world’s center for technological innovation. It hosts the headquarters of leading companies involved in artificial intelligence development, software creation, and modern devices.",
    "shenzhen": "Shenzhen, China",
    "shenzhen_description": "Shenzhen, located in southern China, is a leader in IoT device manufacturing. The city is known for its modern tech parks and rapidly growing infrastructure for startups and tech giants.",
    "helsinki": "Helsinki, Finland",
    "helsinki_description": "Helsinki is Europe’s center for cybersecurity. The city attracts experts and researchers working in data protection, playing a key role in ensuring digital security.",
    "warsaw": "Warsaw, Poland",
    "warsaw_description": "5 out of 7 main researchers of model o1 come from Poland, highlighting the significant contribution of Poles to global AI development. Warsaw is an important scientific and technological hub where innovation plays a key role.",
    "cambridge": "Cambridge, United Kingdom",
    "cambridge_description": "Cambridge, known for its prestigious university, is the birthplace of computer science and theoretical mathematics. It is where A. Turing laid the foundations of modern computing.",
    "reykjavik": "Reykjavik, Iceland",
    "reykjavik_description": "Reykjavik is a leader in renewable energy usage. Most data centers in Iceland are powered by geothermal and hydro energy, making them environmentally friendly.",
    "tel_aviv": "Tel Aviv, Israel",
    "tel_aviv_description": "Tel Aviv is a center of innovation and startups, especially in cybersecurity. The city is home to companies developing modern data protection technologies.",
    "bangalore": "Bangalore, India",
    "bangalore_description": "Bangalore, known as the Silicon Valley of India, is the main hub for software and technology development in Asia. The city attracts programmers and engineers from all over the world.",
    "toronto": "Toronto, Canada",
    "toronto_description": "Toronto is home to Citizen Lab, which investigates threats to human rights in the digital age. The city is also an important center for artificial intelligence and emerging technologies.",
    "svalbard": "Svalbard, Norway",
    "svalbard_description": "Svalbard, an archipelago located in the Arctic Ocean, is home to the Global Seed Vault.",
    "norway": "Norway",
    "norway_description": "Norway is a world leader in recycling plastic bottles, achieving 97% efficiency thanks to the innovative panteordning system. This technology reduces plastic waste and promotes sustainable practices globally.",
    "cape_town": "Cape Town, South Africa",
    "cape_town_description": "Cape Town is not only a well-known tourist destination but also a center of technological innovation on the African continent. The city is home to numerous tech startups working on renewable energy and digital agriculture solutions.",
    "kigali": "Kigali, Rwanda",
    "kigali_description": "Kigali is called the 'Singapore of Africa' due to its modern approach to urban planning and technology. The city has implemented waste management systems and modern public transport technologies such as electric motorcycle taxis.",
    "nairobi": "Nairobi, Kenya",
    "nairobi_description": "Nairobi, known as the 'Silicon Savannah', is the fintech hub of Africa. The city pioneered mobile payment systems like M-Pesa, which revolutionized financial management in the region."
  },
  "aboutMe": {
    "title": "About Me",
    "descriptionStart": "Hi! My name is",
    "name": "Kamil Łukasz Górny",
    "descriptionMiddle": "and I’m a technology enthusiast with interests in cybersecurity, low-level programming, artificial intelligence (including LLMs), and reverse engineering. I’m currently studying R2-level mathematics to prepare for studying",
    "computerScience": "data science",
    "pagePurpose": "This site is a collection of information I've gathered on topics that interest me. It also showcases my knowledge of JavaScript and React, as I built it from scratch without using templates.",
    "coursesTitle": "Courses I’ve Completed",
    "courses": {
      "powershellBeginner": "PowerShell for Beginners – Full Course – 6 Hours Online",
      "powershellBeginnerLink": "https://www.youtube.com/watch?v=LVuI9d-k9C6A",
      "powershellIntermediate": "PowerShell from Beginner to Script Creator – 11 Hours Online",
      "powershellIntermediateLink": "https://www.udemy.com/certificate/UC-10b08877-27be-4fe1-b7d5-8cc3c51ebf4a/",
      "powershellAdvanced": "Advanced PowerShell",
      "powershellAdvancedLink": "https://www.udemy.com/certificate/UC-3d2f6b06-b10d-4e9a-acf8-fdf9ca116538/",
      "comptia": "CompTIA A+ – Full Course – 31 Hours Online",
      "comptiaLink": "https://www.youtube.com/watch?v=IC7XXNKJAYs",
      "pythonBootcamp": "100 Days of Code: The Complete Python Pro Bootcamp – 58 Hours Online",
      "pythonBootcampLink": "https://www.udemy.com/course/100-days-of-code/learn/lecture/23154980#overview",
      "cybersecurity1": "The Complete Cybersecurity Course | 1",
      "cybersecurity1Details": "Certificate: Nathan House BSc. Certificate number 1-2875424334",
      "cybersecurity1Link": "https://funkweb.udemy.com/certificate/UC-009f971d-6af6-471d-85b5-54329e501f06/",
      "cybersecurity2": "The Complete Cybersecurity Course | 2",
      "cybersecurity2Details": "Certificate: Nathan House BSc. Certificate number 2-2875424334",
      "cybersecurity2Link": "https://funkweb.udemy.com/certificate/UC-1e406f53-825a-499b-a430-7c40b6025399/",
      "linux": "Linux for Beginners",
      "linuxLink": "https://www.udemy.com/certificate/UC-b7808161-a224-42ac-a91d-93917d5caeb/",
      "javascriptExpert": "Complete JavaScript Course 2024: From Zero to Expert! – 68.5 Hours",
      "javascriptExpertLink": "https://funkweb.udemy.com/certificate/UC-7945af24-5b63-4bc2-94d7-807eecaee128/",
      "reactCourse": "React.js from Scratch! Learn React, Hooks, Redux, React Router, Next.js",
      "reactCourseLink": "https://funkweb.udemy.com/certificate/UC-ff00381b-26fe-49e1-94f5-80f08bbc31ed/",
      "viewCourseLink": "View Course",
      "viewCertificateLink": "View Certificate"
    },

    "beyondTechnologyTitle": "Beyond Technology",
    "beyondTechnologyDescription": "Outside the world of technology, I love learning foreign languages and traveling. Discovering new cultures, people, and places is a constant source of inspiration and motivation for me. In my free time, I also enjoy reading books or spending time outdoors."
  },
  "privacyPolicy": {
    "title": "Privacy Policy",
    "introduction": "Your privacy is important to us. This privacy policy explains how we collect, use, and protect your personal data while using our services. By using our website and services, you agree to the collection and use of information in accordance with this policy.",
    "dataCollection": {
      "title": "Data Collection",
      "description": "We collect personal data in various ways, including through forms, cookies, and usage tracking. The types of personal data we collect may include your name, email address, phone number, IP address, and information about your use of our website.",
      "methods": {
        "forms": "We collect data that you provide to us directly through forms on our website.",
        "cookies": "Cookies are small files stored on your device that help us track your preferences and usage patterns.",
        "usageTracking": "We collect information about how you use our website, such as the pages you visit, time spent on each page, and links you click."
      }
    },
    "dataUsage": {
      "title": "Data Usage",
      "description": "We use your personal data for the following purposes: providing and improving our services, communicating with you regarding your account or service updates, personalizing experiences, analyzing trends, and monitoring the effectiveness of our website.",
      "purposes": {
        "serviceProvision": "We use your data to provide the services you have requested and to ensure the proper functioning of our website.",
        "communication": "We may contact you with updates, offers, or important information regarding our services.",
        "personalization": "We may personalize content, ads, and user experiences based on your preferences and usage patterns.",
        "analytics": "We analyze data to better understand user behavior and improve our website and services."
      }
    },
    "dataProtection": {
      "title": "Data Protection",
      "description": "We are committed to protecting your personal data. We apply security measures in accordance with industry standards to protect your information from unauthorized access, alteration, disclosure, or destruction. These measures include encryption, firewalls, and secure server infrastructure.",
      "securityMeasures": {
        "encryption": "All sensitive information is securely transmitted using encryption protocols such as SSL/TLS.",
        "accessControl": "We limit access to your personal data to authorized individuals only and ensure they are trained in the importance of data security.",
        "dataRetention": "We retain your personal data only as long as necessary for the purposes outlined in this policy, after which it will be securely deleted or anonymized."
      }
    },
    "cookies": {
      "title": "Cookies",
      "description": "We use cookies to enhance your user experience, analyze website usage, and deliver personalized content. Cookies are small text files placed on your device to track your preferences and usage. You can control and manage cookies through your browser settings, including blocking or deleting them.",
      "types": {
        "essential": "These cookies are essential for the proper functioning of the website and cannot be disabled.",
        "performance": "These cookies help us understand how visitors use our website, allowing us to improve functionality and user experience.",
        "advertising": "These cookies track your browsing habits and may be used to display personalized ads based on your interests."
      }
    },
    "userRights": {
      "title": "User Rights",
      "description": "You have certain rights regarding your personal data. You can access, update, or delete your personal data at any time. You also have the right to object to or restrict certain processing activities, as well as the right to data portability.",
      "rights": {
        "access": "You can request a copy of the personal data we hold about you.",
        "correction": "You can correct any inaccurate or incomplete personal data we hold about you.",
        "deletion": "You can request the deletion of your personal data, subject to certain legal limitations.",
        "restriction": "You can request the restriction of the processing of your personal data in certain circumstances.",
        "portability": "You can request the transfer of your personal data to another organization in a structured, commonly used, and machine-readable format."
      },
      "howToExerciseRights": "To exercise these rights, contact us at [email address] or through the contact form on our website."
    },
    "thirdPartySharing": {
      "title": "Third-Party Data Sharing",
      "description": "We do not sell or share your personal data with third parties for their own marketing purposes. However, we may share your data with trusted service providers who assist us in operating our website, delivering services, or serving you, based on confidentiality agreements. We may also disclose your data if required by law or in response to legal requests."
    },
    "dataTransfers": {
      "title": "Data Transfers",
      "description": "Your personal data may be transferred to and stored on computers located outside your country of residence, where data protection laws may differ. By using our services, you consent to the transfer of your data to countries that may not offer the same level of protection as your own."
    },
    "changes": {
      "title": "Policy Changes",
      "description": "We may update this privacy policy from time to time. Any changes will be posted on this page, and the updated policy will become effective immediately upon posting. We recommend reviewing this policy periodically to stay informed about how we protect your data."
    },
    "contact": {
      "title": "Contact Us",
      "description": "If you have any questions about this privacy policy or our data practices, please contact us at zerodayguardian@proton.me"
    }
  },
  "recommendedTools": {
    "title": "Recommended Tools and Websites",
    "tools": {
      "chatgpt": {
        "name": "ChatGPT",
        "description": "Advanced AI model for text generation and programming assistance.",
        "price": "Free / Plus: $20/month"
      },
      "githubCopilot": {
        "name": "GitHub Copilot",
        "description": "AI coding assistant powered by OpenAI.",
        "price": "$10/month for individual users"
      },
      "figma": {
        "name": "Figma",
        "description": "UI and UX/UI design tool.",
        "price": "Free / Pro: $12/month"
      },
      "canva": {
        "name": "Canva",
        "description": "Easy-to-use graphic design tool.",
        "price": "Free / Pro: $12.99/month"
      },
      "mdnFigure": {
        "name": "MDN Element Figure",
        "description": "Documentation of HTML elements.",
        "price": "Free"
      },
      "deWatermark": {
        "name": "DeWatermark AI",
        "description": "AI-powered watermark removal from images.",
        "price": "Free / Premium"
      },
      "tinypng": {
        "name": "TinyPNG",
        "description": "Image compression tool for PNG and JPEG.",
        "price": "Free / Pro: $25/year"
      },
      "ezgif": {
        "name": "Ezgif",
        "description": "GIF editor for cropping, resizing, optimizing, and converting files.",
        "price": "Free"
      },
      "webaim": {
        "name": "WebAIM Contrast Checker",
        "description": "Color contrast checker tool based on WCAG.",
        "price": "Free"
      },
      "uigoodies": {
        "name": "UI Goodies",
        "description": "Collection of UI/UX resources including color palettes, icons, and tools.",
        "price": "Free"
      },
      "imagetotext": {
        "name": "Image to Text",
        "description": "OCR technology for converting images to text.",
        "price": "Free"
      },
      "coolors": {
        "name": "Coolors",
        "description": "Fast and easy color palette generator for designers and artists.",
        "price": "Free / Pro: $5/month"
      },
      "htmlColorCodes": {
        "name": "HTML Color Codes",
        "description": "Advanced tool for searching and converting HTML color codes.",
        "price": "Free"
      },
      "pdf2docx": {
        "name": "PDF2DOCX",
        "description": "Online converter for transforming PDF files into editable DOCX documents.",
        "price": "Free / Premium"
      },
      "smodin": {
        "name": "Smodin",
        "description": "AI tool for paraphrasing and content generation.",
        "price": "Free / Pro: Various plans"
      },
      "patorjk": {
        "name": "Patorjk",
        "description": "ASCII text generator and various online tools for developers.",
        "price": "Free"
      },
      "deepseek": {
        "name": "Deepseek",
        "description": "Advanced tool for web data search and analysis.",
        "price": "Free / Pro: $15/month"
      },
      "vercelHosting": {
        "name": "Vercel Hosting",
        "description": "Modern cloud hosting for front-end applications.",
        "price": "Free / Pro: from $20/month"
      }
    }
  }
}
