{
  "header": {
    "title": "Zer0-Day Guardian",
    "menu1": "Science et Technologie",
    "menu2": "Futur et Innovations"
  },
  "menu1": {
    "algorithms": "Algorithmes",
    "programming": "Programmation",
    "geometryAnalysis": "Géométrie et Analyse Mathématique",
    "cybersecurity": "Cybersécurité",
    "hardwareEngineering": "Ingénierie Matérielle et Reverse Engineering"
  },
  "menu2": {
    "artificialIntelligence": "Intelligence Artificielle",
    "hacking": "Hacking",
    "apis": "APIs",
    "blockchainCrypto": "Blockchain et Crypto",
    "quantumComputing": "Calcul Quantique",
    "industry4IoT": "Industrie 4.0 et IoT"
  },
  "body": {
    "science": "Science",
    "scienceDescription": "Exploration des connaissances et des découvertes",
    "technology": "Technologie",
    "technologyDescription": "Solutions technologiques innovantes",
    "future": "Futur",
    "futureDescription": "Approche moderne du développement",
    "innovation": "Innovation",
    "innovationDescription": "Idées pionnières façonnant le monde"
  },
  "article": {
    "author": "Auteur",
    "date": "Date"
  },
  "articles": [
    {
      "id": 1,
      "category": "Industry 4.0 and IoT",
      "subcategory": "Futur",
      "title": "Industrie 4.0 et IoT en 2025 : Révolution dans l'Industrie et la Vie Quotidienne",
      "content": "<h2>Industrie 4.0 et IoT...</h2>",
      "image": "/images/articles/article1.png",
      "author": "N00b0dy",
      "date": "2025-01-11"
    },
    {
      "id": 2,
      "category": "Quantum Computing",
      "subcategory": "Innovation",
      "title": "Ordinateurs Quantiques : La Révolution Technologique de l'Avenir",
      "content": "<h2>Ordinateurs Quantiques : La Révolution Technologique de l'Avenir</h2><p>Les ordinateurs quantiques...</p>",
      "image": "/images/articles/Quantum_Computers_The_Technological_Revolution_of_the_Future.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    },
    {
      "id": 3,
      "category": "Cybersecurity",
      "subcategory": "Science",
      "title": "Backdoor dans XZ Utils : Nouvelles Découvertes et Analyse Technique",
      "content": "Découvrez les techniques avancées derrière le backdoor dans XZ Utils et son impact sur la sécurité open-source.",
      "image": "/images/articles/Backdoor_in_XZ_Utils_New_Discoveries_and_Technical_Analysis.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    },
    {
      "id": 4,
      "category": "Algorithms",
      "subcategory": "Science",
      "title": "AES256 : Bases, Histoire et Importance dans la Cybersécurité",
      "content": "AES256 : Bases, Histoire et Importance dans la Cybersécurité",
      "image": "images/articles/AES256 Basics History and Significance in Cybersecurity.webp",
      "author": "N00b0dy",
      "date": "2025-01-14"
    }
  ],

  "map": {
    "silicon_valley": "Silicon Valley",
    "silicon_valley_description": "Silicon Valley, située en Californie, aux États-Unis, est le centre mondial de l'innovation technologique. C'est là que se trouvent les sièges des entreprises leaders en intelligence artificielle, en développement logiciel et en création de technologies modernes.",
    "shenzhen": "Shenzhen, Chine",
    "shenzhen_description": "Shenzhen, dans le sud de la Chine, est reconnu comme le leader mondial de la fabrication de dispositifs IoT. La ville est célèbre pour ses parcs technologiques et son écosystème dynamique pour les start-ups.",
    "helsinki": "Helsinki, Finlande",
    "helsinki_description": "Helsinki est l'un des principaux centres européens de cybersécurité. La ville attire des experts et des chercheurs spécialisés dans la protection des données sensibles, jouant un rôle clé dans la sécurité numérique.",
    "warsaw": "Varsovie, Pologne",
    "warsaw_description": "5 des 7 principaux chercheurs travaillant sur le modèle o1 sont originaires de Pologne, soulignant l'impact important des Polonais sur le développement mondial de l'IA. Varsovie est un centre scientifique et technologique majeur.",
    "cambridge": "Cambridge, Royaume-Uni",
    "cambridge_description": "Cambridge, célèbre pour son université prestigieuse, est considéré comme le berceau de l'informatique et des mathématiques théoriques. C'est ici qu'Alan Turing a posé les bases de l'informatique moderne.",
    "reykjavik": "Reykjavik, Islande",
    "reykjavik_description": "Reykjavik est un leader dans l'utilisation des énergies renouvelables. La plupart des centres de données en Islande fonctionnent grâce à l'énergie géothermique et hydraulique, les rendant écologiquement durables.",
    "tel_aviv": "Tel Aviv, Israël",
    "tel_aviv_description": "Tel Aviv est un centre mondial d'innovation et de start-ups, notamment dans le domaine de la cybersécurité. La ville abrite des entreprises développant des technologies avancées pour la protection des données.",
    "bangalore": "Bangalore, Inde",
    "bangalore_description": "Bangalore, souvent appelée la Silicon Valley de l'Inde, est un centre clé pour le développement logiciel et technologique. La ville attire des développeurs et ingénieurs talentueux du monde entier.",
    "toronto": "Toronto, Canada",
    "toronto_description": "Toronto abrite Citizen Lab, un centre de recherche qui analyse les menaces pesant sur les droits humains à l'ère numérique. La ville est également un pôle majeur pour le développement de l'intelligence artificielle et des technologies de pointe.",
    "svalbard": "Svalbard, Norvège",
    "svalbard_description": "Svalbard, un archipel situé dans l'océan Arctique, abrite la Réserve mondiale de semences. Ce coffre-fort unique en son genre stocke les semences des cultures essentielles à l'humanité, garantissant la biodiversité alimentaire mondiale face aux catastrophes naturelles, aux conflits humains et au changement climatique.",
    "norway": "Norvège",
    "norway_description": "La Norvège est leader mondial dans le recyclage des bouteilles en plastique, avec un taux de recyclage de 97% grâce à son système innovant panteordning. Cette technologie avancée réduit les déchets plastiques et inspire des pratiques durables à l'échelle internationale.",
    "cape_town": "Le Cap, Afrique du Sud",
    "cape_town_description": "Le Cap n'est pas seulement une destination touristique célèbre, mais aussi un centre d'innovation technologique sur le continent africain. La ville abrite de nombreuses start-ups technologiques travaillant sur des solutions dans les énergies renouvelables et l'agriculture numérique.",
    "kigali": "Kigali, Rwanda",
    "kigali_description": "Kigali est surnommée le 'Singapour de l'Afrique' en raison de son approche moderne de l'urbanisme et de la technologie. La ville a mis en place des systèmes de gestion des déchets et des technologies de transport public avancées, comme les motos-taxis électriques.",
    "nairobi": "Nairobi, Kenya",
    "nairobi_description": "Nairobi, connue sous le nom de 'Silicon Savannah', est un centre de fintech en Afrique. La ville a été pionnière dans l'introduction de systèmes de paiement mobile comme M-Pesa, révolutionnant la gestion financière dans la région."
  },

  "aboutMe": {
    "title": "À propos de moi",
    "descriptionStart": "Bonjour ! Je m'appelle",
    "name": "Kamil Lukas Gorny",
    "descriptionMiddle": "et je suis un passionné de technologie combinant des intérêts en cybersécurité, programmation bas niveau, intelligence artificielle (y compris les modèles LLM) et rétro-ingénierie. Actuellement, j'étudie les mathématiques au niveau R2 pour me préparer à",
    "computerScience": "l'informatique",
    "pagePurpose": "Ce site est une collection d'informations que j'ai rassemblées sur des sujets qui m'intéressent. Il démontre également mes connaissances en JavaScript et React, car je l'ai construit de zéro sans utiliser de modèles.",
    "coursesTitle": "Cours que j'ai terminés",
    "courses": {
      "powershellBeginner": "Tutoriel PowerShell Débutant - Cours complet – 6 heures en ligne",
      "powershellBeginnerLink": "https://www.youtube.com/watch?v=LVuI9d-k9C6A",
      "powershellIntermediate": "PowerShell : du débutant au développeur de scripts – 11 heures en ligne",
      "powershellIntermediateLink": "https://www.udemy.com/certificate/UC-10b08877-27be-4fe1-b7d5-8cc3c51ebf4a/",
      "powershellAdvanced": "PowerShell Avancé",
      "powershellAdvancedLink": "https://www.udemy.com/certificate/UC-3d2f6b06-b10d-4e9a-acf8-fdf9ca116538/",
      "comptia": "CompTIA A+ - Cours complet – 31 heures en ligne",
      "comptiaLink": "https://www.youtube.com/watch?v=IC7XXNKJAYs",
      "pythonBootcamp": "100 Days of Code : Le Bootcamp Python Complet – 58 heures en ligne",
      "pythonBootcampLink": "https://www.udemy.com/course/100-days-of-code/learn/lecture/23154980#overview",
      "cybersecurity1": "Le Cours Complet de Cybersécurité | V1",
      "cybersecurity1Details": "Certificat : Nathan House BSc. Numéro de certificat 1-2875424334",
      "cybersecurity1Link": "https://funkweb.udemy.com/certificate/UC-009f971d-6af6-471d-85b5-54329e501f06/",
      "cybersecurity2": "Le Cours Complet de Cybersécurité | V2",
      "cybersecurity2Details": "Certificat : Nathan House BSc. Numéro de certificat 2-2875424334",
      "cybersecurity2Link": "https://funkweb.udemy.com/certificate/UC-1e406f53-825a-499b-a430-7c40b6025399/",
      "linux": "Linux pour débutants",
      "linuxLink": "https://www.udemy.com/certificate/UC-b7808161-a224-42ac-a91d-93917d5caeb/",
      "javascriptExpert": "Le Cours Complet de JavaScript 2024 : Du Débutant à l'Expert ! – 68.5 heures totales",
      "javascriptExpertLink": "https://funkweb.udemy.com/certificate/UC-7945af24-5b63-4bc2-94d7-807eecaee128/",
      "viewCourseLink": "Voir le cours",
      "viewCertificateLink": "Voir le certificat"
    },
    "beyondTechnologyTitle": "Au-delà de la technologie",
    "beyondTechnologyDescription": "En dehors de la technologie, j'aime passer mon temps de manière active. Le snowboard et la randonnée en montagne sont mes moyens préférés pour me détendre et me ressourcer. Pendant mon temps libre, j'aime lire des livres ou explorer le monde qui m'entoure, en puisant de l'inspiration dans chaque expérience."
  },
  "privacyPolicy": {
    "title": "Politique de confidentialité",
    "introduction": "Votre vie privée est importante pour nous. Cette politique de confidentialité explique comment nous collectons, utilisons et protégeons vos données personnelles lorsque vous utilisez nos services. En accédant à notre site web et en utilisant nos services, vous acceptez la collecte et l'utilisation des informations conformément à cette politique.",
    "dataCollection": {
      "title": "Collecte de données",
      "description": "Nous collectons des données personnelles de diverses manières, notamment via des formulaires que vous soumettez, des cookies et le suivi de l'utilisation. Les types de données personnelles que nous collectons peuvent inclure votre nom, adresse e-mail, numéro de téléphone, adresse IP et des informations sur votre utilisation de notre site web.",
      "methods": {
        "forms": "Nous collectons des données que vous nous fournissez directement via des formulaires sur notre site web.",
        "cookies": "Les cookies sont de petits fichiers stockés sur votre appareil qui nous aident à suivre vos préférences et vos habitudes d'utilisation.",
        "usageTracking": "Nous collectons des informations sur la manière dont vous utilisez notre site web, telles que les pages que vous visitez, le temps passé sur chaque page et les liens que vous cliquez."
      }
    },
    "dataUsage": {
      "title": "Utilisation des données",
      "description": "Nous utilisons vos données personnelles pour les fins suivantes : fournir et améliorer nos services, communiquer avec vous concernant votre compte ou des mises à jour de nos services, personnaliser votre expérience, analyser les tendances et surveiller l'efficacité de notre site web.",
      "purposes": {
        "serviceProvision": "Nous utilisons vos données pour fournir les services que vous demandez et pour nous assurer que notre site fonctionne correctement.",
        "communication": "Nous pouvons vous contacter avec des mises à jour, des offres ou des informations importantes liées à nos services.",
        "personalization": "Nous pouvons personnaliser le contenu, les publicités et l'expérience utilisateur en fonction de vos préférences et de vos habitudes d'utilisation.",
        "analytics": "Nous analysons les données pour mieux comprendre le comportement des utilisateurs et améliorer notre site web et nos services."
      }
    },
    "dataProtection": {
      "title": "Protection des données",
      "description": "Nous nous engageons à protéger vos données personnelles. Nous mettons en œuvre des mesures de sécurité conformes aux normes de l'industrie pour protéger vos informations contre l'accès non autorisé, la modification, la divulgation ou la destruction. Ces mesures incluent le cryptage, les pare-feu et une infrastructure de serveurs sécurisée.",
      "securityMeasures": {
        "encryption": "Toutes les informations sensibles sont transmises de manière sécurisée à l'aide de protocoles de cryptage tels que SSL/TLS.",
        "accessControl": "Nous limitons l'accès à vos données personnelles aux seuls membres du personnel autorisés, et nous nous assurons qu'ils sont formés à l'importance de la sécurité des données.",
        "dataRetention": "Nous conservons vos données personnelles uniquement pendant la durée nécessaire aux fins énoncées dans cette politique, après quoi elles seront supprimées ou anonymisées de manière sécurisée."
      }
    },
    "cookies": {
      "title": "Cookies",
      "description": "Nous utilisons des cookies pour améliorer votre expérience utilisateur, analyser l'utilisation du site et fournir du contenu personnalisé. Les cookies sont de petits fichiers texte qui sont placés sur votre appareil pour suivre vos préférences et votre utilisation. Vous pouvez contrôler et gérer les cookies via les paramètres de votre navigateur, y compris les bloquer ou les supprimer.",
      "types": {
        "essential": "Ces cookies sont nécessaires au bon fonctionnement du site web et ne peuvent pas être désactivés.",
        "performance": "Ces cookies nous aident à comprendre comment les visiteurs utilisent notre site web, ce qui nous permet d'améliorer la fonctionnalité et l'expérience utilisateur.",
        "advertising": "Ces cookies suivent vos habitudes de navigation et peuvent être utilisés pour afficher des publicités personnalisées en fonction de vos intérêts."
      }
    },
    "userRights": {
      "title": "Droits des utilisateurs",
      "description": "Vous avez certains droits concernant vos données personnelles. Vous pouvez accéder, mettre à jour ou supprimer vos données personnelles à tout moment. Vous avez également le droit de vous opposer à ou de restreindre certaines activités de traitement, ainsi que le droit à la portabilité des données.",
      "rights": {
        "access": "Vous pouvez demander une copie des données personnelles que nous détenons à votre sujet.",
        "correction": "Vous pouvez corriger toute donnée personnelle inexacte ou incomplète que nous détenons à votre sujet.",
        "deletion": "Vous pouvez demander que nous supprimions vos données personnelles, sous réserve de certaines limitations légales.",
        "restriction": "Vous pouvez demander que nous limitions le traitement de vos données personnelles dans certaines circonstances.",
        "portability": "Vous pouvez demander que nous transférions vos données personnelles à une autre organisation, dans un format structuré, couramment utilisé et lisible par machine."
      },
      "howToExerciseRights": "Pour exercer l'un de ces droits, veuillez nous contacter à [adresse e-mail] ou via le formulaire de contact sur notre site web."
    },
    "thirdPartySharing": {
      "title": "Partage avec des tiers",
      "description": "Nous ne vendons pas et ne partageons pas vos données personnelles avec des tiers à des fins de marketing. Cependant, nous pouvons partager vos données avec des prestataires de services tiers de confiance qui nous aident à exploiter notre site web, à mener nos activités ou à vous fournir des services, sous des accords de confidentialité stricts. Nous pouvons également divulguer vos données si la loi l'exige ou en réponse à des demandes légales."
    },
    "dataTransfers": {
      "title": "Transferts de données",
      "description": "Vos données personnelles peuvent être transférées et stockées sur des ordinateurs situés en dehors de votre pays de résidence, où les lois de protection des données peuvent différer. En utilisant nos services, vous consentez au transfert de vos données vers des pays qui ne fournissent peut-être pas le même niveau de protection que votre pays d'origine."
    },
    "changes": {
      "title": "Modifications de la politique",
      "description": "Nous pouvons mettre à jour cette politique de confidentialité de temps en temps. Toute modification sera publiée sur cette page et la politique mise à jour sera effective dès sa publication. Nous vous recommandons de revoir périodiquement cette politique pour rester informé sur la manière dont nous protégeons vos données."
    },
    "contact": {
      "title": "Contactez-nous",
      "description": "Si vous avez des questions concernant cette politique de confidentialité ou nos pratiques en matière de données, veuillez nous contacter à zerodayguardian@proton.me."
    }
  },
  "recommendedTools": {
    "title": "Outils et sites Web recommandés",
    "tools": {
      "chatgpt": {
        "name": "ChatGPT",
        "description": "Modèle d'IA avancé pour la génération de texte et l'assistance au codage.",
        "price": "Gratuit / Plus : 20$/mois"
      },
      "githubCopilot": {
        "name": "GitHub Copilot",
        "description": "Assistant de codage alimenté par l'IA d'OpenAI.",
        "price": "10$/mois pour les utilisateurs individuels"
      },
      "figma": {
        "name": "Figma",
        "description": "Outil pour la conception et le prototypage UI/UX.",
        "price": "Gratuit / Pro : 12$/mois"
      },
      "canva": {
        "name": "Canva",
        "description": "Outil de conception graphique facile à utiliser.",
        "price": "Gratuit / Pro : 12,99$/mois"
      },
      "mdnFigure": {
        "name": "MDN Élément Figure",
        "description": "Documentation pour l'élément HTML <figure>.",
        "price": "Gratuit"
      },
      "deWatermark": {
        "name": "DeWatermark AI",
        "description": "Suppression de filigranes par intelligence artificielle.",
        "price": "Gratuit / Premium"
      },
      "tinypng": {
        "name": "TinyPNG",
        "description": "Outil de compression d'images PNG et JPEG.",
        "price": "Gratuit / Pro : 25$/an"
      },
      "ezgif": {
        "name": "Ezgif",
        "description": "Éditeur de GIF pour couper, redimensionner, optimiser et convertir des fichiers.",
        "price": "Gratuit"
      },
      "webaim": {
        "name": "WebAIM Contrast Checker",
        "description": "Outil de vérification du contraste des couleurs selon WCAG.",
        "price": "Gratuit"
      },
      "uigoodies": {
        "name": "UI Goodies",
        "description": "Collection de ressources UI/UX, y compris des palettes de couleurs, des icônes et des outils.",
        "price": "Gratuit"
      },
      "imagetotext": {
        "name": "Image to Text",
        "description": "Technologie OCR pour convertir des images en texte.",
        "price": "Gratuit"
      },
      "coolors": {
        "name": "Coolors",
        "description": "Générateur rapide et facile de palettes de couleurs pour les designers et artistes.",
        "price": "Gratuit / Pro : 5$/mois"
      },
      "htmlColorCodes": {
        "name": "HTML Color Codes",
        "description": "Outil complet pour trouver et convertir les codes couleur HTML.",
        "price": "Gratuit"
      },
      "pdf2docx": {
        "name": "PDF2DOCX",
        "description": "Convertisseur en ligne pour transformer les fichiers PDF en DOCX éditables.",
        "price": "Gratuit / Premium"
      },
      "smodin": {
        "name": "Smodin",
        "description": "Outil d'IA pour la reformulation et la génération de texte.",
        "price": "Gratuit / Pro : Divers forfaits"
      },
      "patorjk": {
        "name": "Patorjk",
        "description": "Générateur de texte ASCII et divers outils en ligne pour les développeurs.",
        "price": "Gratuit"
      }
    }
  }
}
