{
  "header": {
    "title": "Zer0-Day Guardian",
    "menu1": "☰ Vitenskap og Teknologi",
    "menu2": "☰ Fremtid og Innovasjoner"
  },
  "menu1": {
    "algorithms": "Algoritmer",
    "programming": "Programmering",
    "geometryAnalysis": "Geometri og Matematisk Analyse",
    "cybersecurity": "Cybersikkerhet",
    "hardwareEngineering": "Maskinvare og Reverse Engineering"
  },
  "menu2": {
    "artificialIntelligence": "Kunstig Intelligens",
    "hacking": "Hacking",
    "apis": "APIs",
    "blockchainCrypto": "Blockchain og Kryptovaluta",
    "quantumComputing": "Kvantdatabehandling",
    "industry4IoT": "Industri 4.0 og IoT"
  },
  "body": {
    "science": "Vitenskap",
    "scienceDescription": "Utforskning av kunnskap og oppdagelser",
    "technology": "Teknologi",
    "technologyDescription": "Innovative teknologiske løsninger",
    "future": "Fremtid",
    "futureDescription": "Moderne tilnærming til utvikling",
    "innovation": "Innovasjon",
    "innovationDescription": "Banebrytende ideer som former verden"
  },
  "article": {
    "author": "Forfatter",
    "date": "Dato"
  },
  "articles": {
    "1": {
      "category": "Industry 4.0 and IoT",
      "title": "Industri 4.0 og IoT i 2025: Revolusjon i Industrien og Hverdagen",
      "content": "<h2>Industri 4.0 og IoT...</h2>",
      "image": "/images/articles/article1.png",
      "author": "N00b0dy",
      "date": "2025-01-11"
    },
    "2": {
      "category": "Quantum Computing",
      "subcategory": "Innovation",
      "title": "Kvantdatamaskiner: Den Teknologiske Revolusjonen i Fremtiden",
      "content": "<h2>Kvantdatamaskiner: Den Teknologiske Revolusjonen i Fremtiden</h2><p>Kvantdatamaskiner...</p>",
      "image": "/images/articles/Quantum_Computers_The_Technological_Revolution_of_the_Future.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    }
  },
  "3": {
    "category": "Cybersecurity",
    "subcategory": "Science",
    "title": "Backdoor i XZ Utils: Nye Funksjoner og Teknisk Analyse",
    "content": "Oppdag avanserte teknikker bak backdoor i XZ Utils og dens innvirkning på open-source sikkerhet.",
    "image": "/images/articles/Backdoor_in_XZ_Utils_New_Discoveries_and_Technical_Analysis.png",
    "author": "N00b0dy",
    "date": "2025-01-13"
  },

  "4": {
    "category": "Algorithms",
    "subcategory": "Science",
    "title": "AES256: Grunnleggende, Historie og Betydning innen Cybersecurity",
    "content": "AES256: Grunnleggende, Historie og Betydning innen Cybersecurity",
    "image": "images/articles/AES256 Basics History and Significance in Cybersecurity.webp",
    "author": "N00b0dy",
    "date": "2025-01-14"
  },

  "map": {
    "silicon_valley": "Silicon Valley",
    "silicon_valley_description": "Silicon Valley i California, USA, er verdens sentrum for teknologisk innovasjon. Her holder de ledende selskapene innen kunstig intelligens, programvareutvikling og moderne teknologi til.",
    "shenzhen": "Shenzhen, Kina",
    "shenzhen_description": "Shenzhen, som ligger i Sør-Kina, er kjent som verdensledende innen produksjon av IoT-enheter. Byen er et mekka for teknologiparker og nystartede bedrifter.",
    "helsinki": "Helsinki, Finland",
    "helsinki_description": "Helsinki er et av Europas fremste sentre for cybersikkerhet. Byen tiltrekker seg eksperter og forskere som spesialiserer seg på datasikkerhet og beskyttelse av sensitive data.",
    "warsaw": "Warszawa, Polen",
    "warsaw_description": "5 av 7 ledende forskere som jobber med o1-modellen, kommer fra Polen. Dette fremhever polakkers betydelige bidrag til global AI-utvikling. Warszawa er et viktig vitenskapelig og teknologisk knutepunkt.",
    "cambridge": "Cambridge, Storbritannia",
    "cambridge_description": "Cambridge er kjent for sitt prestisjetunge universitet og regnes som fødestedet for informatikk og teoretisk matematikk. Her arbeidet Alan Turing, som la grunnlaget for moderne datavitenskap.",
    "reykjavik": "Reykjavik, Island",
    "reykjavik_description": "Reykjavik er kjent for sin bruk av fornybar energi. De fleste datasentrene på Island drives av geotermisk og vannkraft, noe som gjør dem miljøvennlige.",
    "tel_aviv": "Tel Aviv, Israel",
    "tel_aviv_description": "Tel Aviv er et globalt sentrum for innovasjon og oppstartsbedrifter, spesielt innen cybersikkerhet. Byen er hjem for selskaper som utvikler avanserte teknologier for databeskyttelse.",
    "bangalore": "Bangalore, India",
    "bangalore_description": "Bangalore, kjent som Indias Silicon Valley, er et viktig knutepunkt for programvareutvikling og teknologi. Byen tiltrekker seg talentfulle ingeniører og utviklere fra hele verden.",
    "toronto": "Toronto, Canada",
    "toronto_description": "Toronto er hjemsted for Citizen Lab, en forskningsenhet som studerer trusler mot menneskerettigheter i den digitale tidsalderen. Byen er også et ledende senter for utvikling av kunstig intelligens og ny teknologi.",
    "svalbard": "Svalbard, Norge",
    "svalbard_description": "Svalbard, en øygruppe i Polhavet, er hjemmet til Globalt Frøbank.",
    "norway": "Oslo, Norge",
    "norway_description": "Norge er verdensledende innen resirkulering av plastflasker, med en resirkuleringsrate på 97 % takket være det innovative panteordning-systemet. Denne teknologien bidrar til å redusere plastavfall og fremmer bærekraftige praksiser globalt.",
    "cape_town": "Cape Town, Sør-Afrika",
    "cape_town_description": "Cape Town er ikke bare en kjent turistdestinasjon, men også et knutepunkt for teknologisk innovasjon på det afrikanske kontinentet. Byen er hjemsted for en rekke teknologiske oppstartsbedrifter som arbeider med løsninger innen fornybar energi og digitalt landbruk.",
    "kigali": "Kigali, Rwanda",
    "kigali_description": "Kigali kalles 'Afrikas Singapore' på grunn av sin moderne tilnærming til byplanlegging og teknologi. Byen har implementert avfallshåndteringssystemer og avansert offentlig transportteknologi, som elektriske motorsykkeltaxier.",
    "nairobi": "Nairobi, Kenya",
    "nairobi_description": "Nairobi, kjent som 'Silicon Savannah', er et fintech-knutepunkt i Afrika. Byen var pioner i innføringen av mobile betalingssystemer som M-Pesa, som revolusjonerte finansforvaltningen i regionen."
  },
  "aboutMe": {
    "title": "Om meg",
    "descriptionStart": "Hei! Mitt navn er",
    "name": "Kamil Lukas Gorny",
    "descriptionMiddle": "og jeg er en teknologientusiast som kombinerer interesser for cybersikkerhet, lavnivåprogrammering, kunstig intelligens (inkludert LLM-modeller) og reverse engineering. For tiden studerer jeg matematikk på R2-nivå for å forberede meg til å studere",
    "computerScience": "datavitenskap",
    "pagePurpose": "Denne nettsiden er en samling av informasjon jeg har samlet om emner som interesserer meg. Den demonstrerer også min kunnskap om JavaScript og React, siden jeg har bygget den fra bunnen av uten bruk av maler.",
    "coursesTitle": "Kurs jeg har fullført",
    "courses": {
      "powershellBeginner": "PowerShell nybegynnerkurs – 6 timer online",
      "powershellBeginnerLink": "https://www.youtube.com/watch?v=LVuI9d-k9C6A",
      "powershellIntermediate": "PowerShell fra nybegynner til skriptutvikler – 11 timer online",
      "powershellIntermediateLink": "https://www.udemy.com/certificate/UC-10b08877-27be-4fe1-b7d5-8cc3c51ebf4a/",
      "powershellAdvanced": "PowerShell avansert",
      "powershellAdvancedLink": "https://www.udemy.com/certificate/UC-3d2f6b06-b10d-4e9a-acf8-fdf9ca116538/",
      "comptia": "CompTIA A+ Fullstendig kurs – 31 timer online",
      "comptiaLink": "https://www.youtube.com/watch?v=1CZXXNKAY5o",
      "pythonBootcamp": "100 Days of Code: Komplett Python Pro Bootcamp – 58 timer online",
      "pythonBootcampLink": "https://www.udemy.com/course/100-days-of-code/learn/lecture/23154980#overview",
      "cybersecurity1": "Det komplette kurset i cybersikkerhet | V1",
      "cybersecurity1Details": "Sertifikat: Nathan House BSc. Sertifikatnummer 1-2875424334",
      "cybersecurity1Link": "https://funkweb.udemy.com/certificate/UC-009f971d-6af6-471d-85b5-54329e501f06/",
      "cybersecurity2": "Det komplette kurset i cybersikkerhet | V2",
      "cybersecurity2Details": "Sertifikat: Nathan House BSc. Sertifikatnummer 2-2875424334",
      "cybersecurity2Link": "https://funkweb.udemy.com/certificate/UC-1e406f53-825a-499b-a430-7c40b6025399/",
      "linux": "Linux for nybegynnere",
      "linuxLink": "https://funkweb.udemy.com/certificate/UC-b7808161-a224-42ac-a91d-939f17d5caeb/",
      "javascriptExpert": "Det komplette JavaScript-kurset 2024: Fra nybegynner til ekspert! – 68,5 timer totalt",
      "javascriptExpertLink": "https://funkweb.udemy.com/certificate/UC-7945af24-5b63-4bc2-94d7-807eecaee128/",
      "reactCourse": "React.js fra bunnen av! Lær React, Hooks, Redux, React Router, Next.js",
      "reactCourseLink": "https://funkweb.udemy.com/certificate/UC-ff00381b-26fe-49e1-94f5-80f08bbc31ed/",
      "viewCourseLink": "Vis kurs",
      "viewCertificateLink": "Vis sertifikat"
    },

    "beyondTechnologyTitle": "Utenfor teknologi",
    "beyondTechnologyDescription": "Utenfor teknologiverdenen elsker jeg å bruke tiden aktivt. Snowboard og fjellvandring er mine favorittmåter å slappe av og lade opp. På fritiden liker jeg å lese bøker eller utforske verden rundt meg, og hente inspirasjon fra hver opplevelse."
  },
  "privacyPolicy": {
    "title": "Personvernpolitikk",
    "introduction": "Personvernet ditt er viktig for oss. Denne personvernpolitikken forklarer hvordan vi samler inn, bruker og beskytter dine personlige data når du bruker tjenestene våre. Ved å få tilgang til eller bruke nettstedet vårt og tjenestene våre, samtykker du til innsamling og bruk av informasjon i samsvar med denne politikken.",
    "dataCollection": {
      "title": "Datainnsamling",
      "description": "Vi samler inn personopplysninger på ulike måter, inkludert gjennom skjemaer du sender inn, informasjonskapsler og bruksoppfølging. Typene personopplysninger vi samler inn kan omfatte navnet ditt, e-postadresse, telefonnummer, IP-adresse og informasjon om hvordan du bruker nettstedet vårt.",
      "methods": {
        "forms": "Vi samler inn data som du gir oss direkte gjennom skjemaer på nettstedet vårt.",
        "cookies": "Informasjonskapsler er små filer som lagres på enheten din som hjelper oss å spore preferansene dine og bruks mønstre.",
        "usageTracking": "Vi samler inn informasjon om hvordan du bruker nettstedet vårt, for eksempel sidene du besøker, hvor lenge du er på hver side, og hvilke lenker du klikker på."
      }
    },
    "dataUsage": {
      "title": "Bruk av data",
      "description": "Vi bruker dine personlige data til følgende formål: for å tilby og forbedre tjenestene våre, kommunisere med deg om kontoen din eller oppdateringer av tjenestene våre, personalisere opplevelsen din, analysere trender og overvåke effektiviteten til nettstedet vårt.",
      "purposes": {
        "serviceProvision": "Vi bruker dataene dine for å levere tjenestene du etterspør og sikre at nettstedet vårt fungerer som det skal.",
        "communication": "Vi kan kontakte deg med oppdateringer, tilbud eller viktig informasjon relatert til tjenestene våre.",
        "personalization": "Vi kan tilpasse innhold, annonser og brukeropplevelsen basert på preferansene og bruks mønstrene dine.",
        "analytics": "Vi analyserer dataene for bedre å forstå brukeratferd og forbedre nettstedet vårt og tjenestene våre."
      }
    },
    "dataProtection": {
      "title": "Databeskyttelse",
      "description": "Vi er forpliktet til å beskytte personopplysningene dine. Vi implementerer bransjestandard sikkerhetstiltak for å beskytte informasjonen din mot uautorisert tilgang, endring, avsløring eller ødeleggelse. Disse tiltakene inkluderer kryptering, brannmurer og sikker serverinfrastruktur.",
      "securityMeasures": {
        "encryption": "All sensitiv informasjon overføres sikkert ved hjelp av krypteringsprotokoller som SSL/TLS.",
        "accessControl": "Vi begrenser tilgangen til dine personlige data til autorisert personale, og sørger for at de er opplært om viktigheten av datasikkerhet.",
        "dataRetention": "Vi beholder dine personlige data kun så lenge det er nødvendig for formålene som er beskrevet i denne politikken, og etter det vil de bli trygt slettet eller anonymisert."
      }
    },
    "cookies": {
      "title": "Informasjonskapsler",
      "description": "Vi bruker informasjonskapsler for å forbedre brukeropplevelsen din, analysere bruken av nettstedet og tilby personlig tilpasset innhold. Informasjonskapsler er små tekstfiler som plasseres på enheten din for å spore preferanser og bruken din. Du kan kontrollere og administrere informasjonskapsler gjennom nettleserinnstillingene, inkludert blokkering eller sletting.",
      "types": {
        "essential": "Disse informasjonskapslene er nødvendige for at nettstedet skal fungere riktig og kan ikke deaktiveres.",
        "performance": "Disse informasjonskapslene hjelper oss å forstå hvordan besøkende bruker nettstedet vårt, slik at vi kan forbedre funksjonalitet og brukeropplevelse.",
        "advertising": "Disse informasjonskapslene sporer nettlesingsvanene dine og kan brukes til å vise tilpassede annonser basert på interessene dine."
      }
    },
    "userRights": {
      "title": "Brukerrettigheter",
      "description": "Du har visse rettigheter angående dine personlige data. Du kan når som helst få tilgang til, oppdatere eller slette dine personlige data. Du har også rett til å motsette deg eller begrense visse behandlingsaktiviteter, samt rett til dataportabilitet.",
      "rights": {
        "access": "Du kan be om en kopi av de personlige dataene vi har om deg.",
        "correction": "Du kan rette eventuelle unøyaktige eller ufullstendige personopplysninger vi har om deg.",
        "deletion": "Du kan be om at vi sletter dine personlige data, med visse juridiske begrensninger.",
        "restriction": "Du kan be om at vi begrenser behandlingen av dine personlige data under visse omstendigheter.",
        "portability": "Du kan be om at vi overfører dine personlige data til en annen organisasjon, i et strukturert, vanlig brukt og maskinlesbart format."
      },
      "howToExerciseRights": "For å utøve noen av disse rettighetene, vennligst kontakt oss på [e-postadresse] eller gjennom kontaktskjemaet på nettstedet vårt."
    },
    "thirdPartySharing": {
      "title": "Deling med tredjeparter",
      "description": "Vi selger ikke og deler ikke dine personlige data med tredjeparter for deres egne markedsføringsformål. Imidlertid kan vi dele dataene dine med pålitelige tredjeparts tjenesteleverandører som hjelper oss med å drifte nettstedet vårt, drive virksomheten vår eller betjene deg, under strenge konfidensialitetsavtaler. Vi kan også avsløre dataene dine dersom det kreves av loven eller som svar på juridiske forespørsler."
    },
    "dataTransfers": {
      "title": "Datatransfer",
      "description": "Dine personlige data kan bli overført og lagret på datamaskiner som ligger utenfor ditt bostedsland, der lovgivningen for databeskyttelse kan være annerledes. Ved å bruke tjenestene våre samtykker du til overføring av dataene dine til land som kanskje ikke gir samme nivå av beskyttelse som hjemlandet ditt."
    },
    "changes": {
      "title": "Endringer i policy",
      "description": "Vi kan oppdatere denne personvernpolitikken fra tid til annen. Eventuelle endringer vil bli publisert på denne siden, og den oppdaterte politikken vil tre i kraft så snart den er publisert. Vi anbefaler at du regelmessig gjennomgår denne politikken for å holde deg informert om hvordan vi beskytter dataene dine."
    },
    "contact": {
      "title": "Kontakt oss",
      "description": "Hvis du har spørsmål om denne personvernpolitikken eller våre datapraksiser, vennligst kontakt oss på zerodayguardian@proton.me."
    }
  },

  "recommendedTools": {
    "title": "Anbefalte verktøy og nettsteder",
    "tools": {
      "chatgpt": {
        "name": "ChatGPT",
        "description": "Avansert AI-modell for tekstgenerering og kodeassistanse.",
        "price": "Gratis / Plus: 20$/måned / Pro 200$/måned"
      },
      "githubCopilot": {
        "name": "GitHub Copilot",
        "description": "AI-drevet kodeassistent fra OpenAI.",
        "price": "10$/måned for enkeltbrukere"
      },
      "figma": {
        "name": "Figma",
        "description": "Verktøy for UI/UX-design og prototyping.",
        "price": "Gratis / Pro: 12$/måned"
      },
      "canva": {
        "name": "Canva",
        "description": "Enkel grafisk designverktøy.",
        "price": "Gratis / Pro: 12,99$/måned"
      },
      "mdnFigure": {
        "name": "MDN Figur-element",
        "description": "Dokumentasjon for HTML-elementeter.",
        "price": "Gratis"
      },
      "deWatermark": {
        "name": "DeWatermark AI",
        "description": "Fjerning av vannmerker med kunstig intelligens.",
        "price": "Gratis / Premium"
      },
      "tinypng": {
        "name": "TinyPNG",
        "description": "PNG- og JPEG-bildekomprimeringsverktøy.",
        "price": "Gratis / Pro: 25$/år"
      },
      "ezgif": {
        "name": "Ezgif",
        "description": "GIF-redigeringsverktøy for beskjæring, endring av størrelse, optimalisering og konvertering av filer.",
        "price": "Gratis"
      },
      "webaim": {
        "name": "WebAIM Kontrastkontroller",
        "description": "Verktøy for å sjekke fargekontrast i henhold til WCAG.",
        "price": "Gratis"
      },
      "uigoodies": {
        "name": "UI Goodies",
        "description": "Samling av UI/UX-ressurser som fargepaletter, ikoner og verktøy.",
        "price": "Gratis"
      },
      "imagetotext": {
        "name": "Image to Text",
        "description": "OCR-teknologi for å konvertere bilder til tekst.",
        "price": "Gratis"
      },
      "coolors": {
        "name": "Coolors",
        "description": "Rask og enkel fargepalettgenerator for designere og kunstnere.",
        "price": "Gratis / Pro: 5$/måned"
      },
      "htmlColorCodes": {
        "name": "HTML Color Codes",
        "description": "Omfattende verktøy for å finne og konvertere HTML-fargekoder.",
        "price": "Gratis"
      },
      "pdf2docx": {
        "name": "PDF2DOCX",
        "description": "Online-konverterer for å gjøre PDF-filer om til redigerbare DOCX-filer.",
        "price": "Gratis / Premium"
      },
      "smodin": {
        "name": "Smodin",
        "description": "AI-drevet verktøy for omskriving og generering av tekst.",
        "price": "Gratis / Pro: Ulike planer"
      },
      "patorjk": {
        "name": "Patorjk",
        "description": "ASCII-tekstgenerator og ulike online-verktøy for utviklere.",
        "price": "Gratis"
      },
      "deepseek": {
        "name": "Deepseek",
        "description": "Et avansert verktøy for søk og dataanalyse på nettet.",
        "price": "Gratis / Pro: 15$/måned"
      },
      "vercelHosting": {
        "name": "Vercel Hosting",
        "description": "Moderne skyhosting for front-end-applikasjoner.",
        "price": "Gratis / Pro: fra 20$/måned"
      }
    }
  }
}
