{
  "header": {
    "title": "Zer0-Day Guardian",
    "menu1": "Наука и Технологии",
    "menu2": "Будущее и Инновации"
  },
  "menu1": {
    "algorithms": "Алгоритмы",
    "programming": "Программирование",
    "geometryAnalysis": "Геометрия и Математический Анализ",
    "cybersecurity": "Кибербезопасность",
    "hardwareEngineering": "Инженерия Аппаратного Обеспечения и Реверс"
  },
  "menu2": {
    "artificialIntelligence": "Искусственный Интеллект",
    "hacking": "Хакинг",
    "apis": "APIs",
    "blockchainCrypto": "Блокчейн и Криптовалюты",
    "quantumComputing": "Квантовые Вычисления",
    "industry4IoT": "Индустрия 4.0 и IoT"
  },
  "body": {
    "science": "Наука",
    "scienceDescription": "Исследование знаний и открытий",
    "technology": "Технологии",
    "technologyDescription": "Инновационные технологические решения",
    "future": "Будущее",
    "futureDescription": "Современный подход к развитию",
    "innovation": "Инновации",
    "innovationDescription": "Передовые идеи, формирующие мир"
  },
  "article": {
    "author": "Автор",
    "date": "Дата"
  },
  "articles": {
    "1": {
      "category": "Industry 4.0 and IoT",
      "title": "Индустрия 4.0 и IoT в 2025 году: Революция в Промышленности и Повседневной Жизни",
      "content": "<h2>Индустрия 4.0 и IoT...</h2>",
      "image": "/images/articles/article1.png",
      "author": "N00b0dy",
      "date": "2025-01-11"
    },
    "2": {
      "category": "Quantum Computing",
      "subcategory": "Innovation",
      "title": "Квантовые Компьютеры: Технологическая Революция Будущего",
      "content": "<h2>Квантовые Компьютеры: Технологическая Революция Будущего</h2><p>Квантовые компьютеры...</p>",
      "image": "/images/articles/Quantum_Computers_The_Technological_Revolution_of_the_Future.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    },
    "3": {
      "category": "Cybersecurity",
      "subcategory": "Science",
      "title": "Backdoor в XZ Utils: Новые Открытия и Технический Анализ",
      "content": "Узнайте о передовых методах, применённых в backdoor XZ Utils, и его влиянии на безопасность open source.",
      "image": "/images/articles/Backdoor_in_XZ_Utils_New_Discoveries_and_Technical_Analysis.png",
      "author": "N00b0dy",
      "date": "2025-01-13"
    },
    "4": {
      "category": "Algorithms",
      "subcategory": "Science",
      "title": "AES256: Основы, История и Значение в Кибербезопасности",
      "content": "AES256: Основы, История и Значение в Кибербезопасности",
      "image": "images/articles/AES256 Basics History and Significance in Cybersecurity.webp",
      "author": "N00b0dy",
      "date": "2025-01-14"
    }
  },

  "map": {
    "silicon_valley": "Силиконовая долина",
    "silicon_valley_description": "Силиконовая долина, расположенная в Калифорнии, США, является мировым центром инноваций в области высоких технологий. Здесь базируются ведущие компании, занимающиеся искусственным интеллектом, разработкой программного обеспечения и созданием новейших гаджетов.",
    "shenzhen": "Шэньчжэнь, Китай",
    "shenzhen_description": "Шэньчжэнь, расположенный в южном Китае, считается столицей мирового производства IoT-устройств. Город известен своими технопарками и мощной инфраструктурой для стартапов и компаний в сфере электроники.",
    "helsinki": "Хельсинки, Финляндия",
    "helsinki_description": "Хельсинки — это один из ведущих центров кибербезопасности в Европе. Город привлекает исследователей и экспертов в области защиты данных, что делает его ключевым игроком в сфере цифровой безопасности.",
    "warsaw": "Варшава, Польша",
    "warsaw_description": "5 из 7 ведущих исследователей модели o1 родом из Польши, что подчеркивает значительный вклад поляков в глобальное развитие ИИ. Варшава — это город, где инновации и наука играют важную роль в технологическом прогрессе.",
    "cambridge": "Кембридж, Великобритания",
    "cambridge_description": "Кембридж, известный своим престижным университетом, считается местом рождения компьютерной науки и теоретической математики. Здесь работал Алан Тьюринг, заложивший основы современной информатики.",
    "reykjavik": "Рейкьявик, Исландия",
    "reykjavik_description": "Рейкьявик — один из лидеров в использовании возобновляемых источников энергии. Большинство центров данных в Исландии работают на геотермальной и гидроэнергии, что делает их экологически устойчивыми.",
    "tel_aviv": "Тель-Авив, Израиль",
    "tel_aviv_description": "Тель-Авив — это мировой центр инноваций и стартапов, особенно в сфере кибербезопасности. Здесь расположены ведущие компании, разрабатывающие технологии для защиты данных и предотвращения кибератак.",
    "bangalore": "Бангалор, Индия",
    "bangalore_description": "Бангалор, часто называемый Силиконовой долиной Индии, является центром разработки программного обеспечения и технологий. Город играет ключевую роль в глобальной IT-индустрии и привлекает талантливых разработчиков со всего мира.",
    "toronto": "Торонто, Канада",
    "toronto_description": "Торонто — дом Citizen Lab, известного исследовательского центра, который изучает угрозы правам человека в цифровую эпоху. Город также является важным хабом для развития искусственного интеллекта и высоких технологий.",
    "svalbard": "Шпицберген, Норвегия",
    "svalbard_description": "Шпицберген, архипелаг в Северном Ледовитом океане, является домом для Глобального семенного хранилища.",
    "norway": "Норвегия",
    "norway_description": "Норвегия является мировым лидером в переработке пластиковых бутылок, достигая уровня переработки 97% благодаря инновационной системе панторднинг. Эта технология снижает количество пластиковых отходов и способствует устойчивому развитию на глобальном уровне.",
    "cape_town": "Кейптаун, Южная Африка",
    "cape_town_description": "Кейптаун — это не только популярное туристическое направление, но и центр технологических инноваций на африканском континенте. Город является домом для многочисленных технологических стартапов, работающих над решениями в области возобновляемой энергии и цифрового сельского хозяйства.",
    "kigali": "Кигали, Руанда",
    "kigali_description": "Кигали называют 'Сингапуром Африки' благодаря современному подходу к городскому планированию и технологиям. Город внедрил системы управления отходами и современные технологии общественного транспорта, такие как электрические мототакси.",
    "nairobi": "Найроби, Кения",
    "nairobi_description": "Найроби, известный как 'Кремниевая саванна', является финансово-технологическим центром Африки. Город стал пионером в введении мобильных платежных систем, таких как M-Pesa, что революционизировало управление финансами в регионе."
  },
  "aboutMe": {
    "title": "Обо мне",
    "descriptionStart": "Привет! Меня зовут",
    "name": "Камиль Лукаш Горный",
    "descriptionMiddle": "и я энтузиаст технологий, сочетающий интересы в области кибербезопасности, низкоуровневого программирования, искусственного интеллекта (включая модели LLM) и обратного проектирования. В настоящее время я изучаю математику на уровне R2, чтобы подготовиться к",
    "computerScience": "информатике",
    "pagePurpose": "Этот сайт представляет собой сборник информации, которую я собрал по темам, которые меня интересуют. Он также демонстрирует мои знания JavaScript и React, так как я создал его с нуля без использования шаблонов.",
    "coursesTitle": "Курсы, которые я завершил",
    "courses": {
      "powershellBeginner": "Основы PowerShell – Полный курс – 6 часов онлайн",
      "powershellBeginnerLink": "https://www.youtube.com/watch?v=LVuI9d-k9C6A",
      "powershellIntermediate": "PowerShell: от начинающего до разработчика скриптов – 11 часов онлайн",
      "powershellIntermediateLink": "https://www.udemy.com/certificate/UC-10b08877-27be-4fe1-b7d5-8cc3c51ebf4a/",
      "powershellAdvanced": "PowerShell: Продвинутый уровень",
      "powershellAdvancedLink": "https://www.udemy.com/certificate/UC-3d2f6b06-b10d-4e9a-acf8-fdf9ca116538/",
      "comptia": "CompTIA A+ Полный курс – 31 час онлайн",
      "comptiaLink": "https://www.youtube.com/watch?v=IC7XXNKJAYs",
      "pythonBootcamp": "100 дней кода: Полный Python Pro Bootcamp – 58 часов онлайн",
      "pythonBootcampLink": "https://www.udemy.com/course/100-days-of-code/learn/lecture/23154980#overview",
      "cybersecurity1": "Полный курс по кибербезопасности | Том 1",
      "cybersecurity1Details": "Сертификат: Натан Хаус, BSc. Номер сертификата 1-2875424334",
      "cybersecurity1Link": "https://funkweb.udemy.com/certificate/UC-009f971d-6af6-471d-85b5-54329e501f06/",
      "cybersecurity2": "Полный курс по кибербезопасности | Том 2",
      "cybersecurity2Details": "Сертификат: Натан Хаус, BSc. Номер сертификата 2-2875424334",
      "cybersecurity2Link": "https://funkweb.udemy.com/certificate/UC-1e406f53-825a-499b-a430-7c40b6025399/",
      "linux": "Linux для начинающих",
      "linuxLink": "https://www.udemy.com/certificate/UC-b7808161-a224-42ac-a91d-93917d5caeb/",
      "javascriptExpert": "Полный курс JavaScript 2024: от новичка до эксперта! – 68,5 часов",
      "javascriptExpertLink": "https://funkweb.udemy.com/certificate/UC-7945af24-5b63-4bc2-94d7-807eecaee128/",
      "viewCourseLink": "Посмотреть курс",
      "viewCertificateLink": "Посмотреть сертификат"
    },
    "beyondTechnologyTitle": "Помимо технологий",
    "beyondTechnologyDescription": "Помимо технологий, я люблю активно проводить время. Сноуборд и походы в горы – мои любимые способы отдыха и расслабления. В свободное время я читаю книги или исследую окружающий мир, черпая вдохновение из каждого пережитого опыта."
  },
  "privacyPolicy": {
    "title": "Политика конфиденциальности",
    "introduction": "Ваше личное пространство важно для нас. Эта политика конфиденциальности объясняет, как мы собираем, используем и защищаем ваши персональные данные, когда вы пользуетесь нашими услугами. Получая доступ к нашему веб-сайту и используя наши услуги, вы соглашаетесь на сбор и использование информации в соответствии с этой политикой.",
    "dataCollection": {
      "title": "Сбор данных",
      "description": "Мы собираем личные данные различными способами, включая формы, которые вы отправляете, cookies и отслеживание использования. Типы персональных данных, которые мы собираем, могут включать ваше имя, адрес электронной почты, номер телефона, IP-адрес и информацию о вашем использовании нашего сайта.",
      "methods": {
        "forms": "Мы собираем данные, которые вы предоставляете нам напрямую через формы на нашем веб-сайте.",
        "cookies": "Cookies — это небольшие файлы, которые сохраняются на вашем устройстве и помогают нам отслеживать ваши предпочтения и поведение на сайте.",
        "usageTracking": "Мы собираем информацию о том, как вы используете наш сайт, например, какие страницы вы посещаете, сколько времени проводите на каждой странице и какие ссылки нажимаете."
      }
    },
    "dataUsage": {
      "title": "Использование данных",
      "description": "Мы используем ваши персональные данные для следующих целей: предоставление и улучшение наших услуг, связь с вами по поводу вашего аккаунта или обновлений наших услуг, персонализация вашего опыта, анализ тенденций и мониторинг эффективности нашего сайта.",
      "purposes": {
        "serviceProvision": "Мы используем ваши данные для предоставления услуг, которые вы запрашиваете, и для обеспечения правильного функционирования нашего сайта.",
        "communication": "Мы можем связаться с вами с обновлениями, предложениями или важной информацией, касающейся наших услуг.",
        "personalization": "Мы можем персонализировать контент, рекламу и пользовательский опыт в зависимости от ваших предпочтений и поведения.",
        "analytics": "Мы анализируем данные, чтобы лучше понять поведение пользователей и улучшить наш сайт и услуги."
      }
    },
    "dataProtection": {
      "title": "Защита данных",
      "description": "Мы обязуемся защищать ваши персональные данные. Мы применяем меры безопасности, соответствующие отраслевым стандартам, чтобы защитить вашу информацию от несанкционированного доступа, изменений, раскрытия или уничтожения. Эти меры включают шифрование, файерволы и безопасную серверную инфраструктуру.",
      "securityMeasures": {
        "encryption": "Вся чувствительная информация передается безопасно с использованием протоколов шифрования, таких как SSL/TLS.",
        "accessControl": "Мы ограничиваем доступ к вашим персональным данным только для авторизованного персонала и обеспечиваем, чтобы они были обучены важности безопасности данных.",
        "dataRetention": "Мы храним ваши персональные данные только столько времени, сколько необходимо для целей, изложенных в этой политике, после чего они будут безопасно удалены или анонимизированы."
      }
    },
    "cookies": {
      "title": "Cookies",
      "description": "Мы используем cookies для улучшения вашего пользовательского опыта, анализа использования сайта и предоставления персонализированного контента. Cookies — это небольшие текстовые файлы, которые размещаются на вашем устройстве для отслеживания ваших предпочтений и поведения. Вы можете контролировать и управлять cookies через настройки вашего браузера, включая их блокировку или удаление.",
      "types": {
        "essential": "Эти cookies необходимы для правильной работы сайта и не могут быть отключены.",
        "performance": "Эти cookies помогают нам понять, как посетители используют наш сайт, что позволяет улучшить функциональность и пользовательский опыт.",
        "advertising": "Эти cookies отслеживают ваши привычки в серфинге и могут быть использованы для отображения персонализированных объявлений на основе ваших интересов."
      }
    },
    "userRights": {
      "title": "Права пользователей",
      "description": "У вас есть определенные права относительно ваших персональных данных. Вы можете получить доступ, обновить или удалить ваши персональные данные в любое время. У вас также есть право возразить против или ограничить определенные действия с вашими данными, а также право на переносимость данных.",
      "rights": {
        "access": "Вы можете запросить копию персональных данных, которые мы храним о вас.",
        "correction": "Вы можете исправить неточные или неполные персональные данные, которые мы храним о вас.",
        "deletion": "Вы можете запросить удаление ваших персональных данных, с учетом определенных юридических ограничений.",
        "restriction": "Вы можете запросить ограничение обработки ваших персональных данных в определенных случаях.",
        "portability": "Вы можете запросить передачу ваших персональных данных другой организации в структурированном, широко используемом и машиночитаемом формате."
      },
      "howToExerciseRights": "Для реализации этих прав, пожалуйста, свяжитесь с нами по [email address] или через форму обратной связи на нашем сайте."
    },
    "thirdPartySharing": {
      "title": "Передача данных третьим лицам",
      "description": "Мы не продаем и не передаем ваши персональные данные третьим лицам для их собственных маркетинговых целей. Однако мы можем поделиться вашими данными с доверенными поставщиками услуг, которые помогают нам в эксплуатации нашего сайта, ведении бизнеса или предоставлении вам услуг, в рамках строгих соглашений о конфиденциальности. Мы также можем раскрыть ваши данные, если это требуется по закону или в ответ на юридические запросы."
    },
    "dataTransfers": {
      "title": "Перевод данных",
      "description": "Ваши персональные данные могут быть переданы и храниться на компьютерах, расположенных за пределами вашей страны проживания, где законы о защите данных могут отличаться. Используя наши услуги, вы соглашаетесь на передачу ваших данных в страны, где уровень защиты может не соответствовать уровню, установленному в вашей стране."
    },
    "changes": {
      "title": "Изменения в политике",
      "description": "Мы можем время от времени обновлять эту политику конфиденциальности. Все изменения будут опубликованы на этой странице, и обновленная политика вступит в силу с момента публикации. Мы рекомендуем периодически проверять эту политику, чтобы оставаться информированным о том, как мы защищаем ваши данные."
    },
    "contact": {
      "title": "Связаться с нами",
      "description": "Если у вас есть вопросы по этой политике конфиденциальности или нашим практикам в отношении данных, пожалуйста, свяжитесь с нами по адресу zerodayguardian@proton.me."
    }
  },

  "recommendedTools": {
    "title": "Рекомендуемые инструменты и веб-сайты",
    "tools": {
      "chatgpt": {
        "name": "ChatGPT",
        "description": "Современная AI-модель для генерации текста и помощи в программировании.",
        "price": "Бесплатно / Plus: 20$/месяц"
      },
      "githubCopilot": {
        "name": "GitHub Copilot",
        "description": "AI-ассистент программирования от OpenAI.",
        "price": "10$/месяц для индивидуальных пользователей"
      },
      "figma": {
        "name": "Figma",
        "description": "Инструмент для проектирования UI/UX и создания макетов.",
        "price": "Бесплатно / Pro: 12$/месяц"
      },
      "canva": {
        "name": "Canva",
        "description": "Простой в использовании инструмент для графического дизайна.",
        "price": "Бесплатно / Pro: 12,99$/месяц"
      },
      "mdnFigure": {
        "name": "MDN Элемент Figure",
        "description": "Документация по HTML-элементу <figure>.",
        "price": "Бесплатно"
      },
      "deWatermark": {
        "name": "DeWatermark AI",
        "description": "Удаление водяных знаков с изображений с помощью AI.",
        "price": "Бесплатно / Премиум"
      },
      "tinypng": {
        "name": "TinyPNG",
        "description": "Инструмент для сжатия изображений PNG и JPEG.",
        "price": "Бесплатно / Pro: 25$/год"
      },
      "ezgif": {
        "name": "Ezgif",
        "description": "Редактор GIF для обрезки, изменения размера, оптимизации и конвертации файлов.",
        "price": "Бесплатно"
      },
      "webaim": {
        "name": "WebAIM Проверка контраста",
        "description": "Инструмент для проверки цветового контраста в соответствии с WCAG.",
        "price": "Бесплатно"
      },
      "uigoodies": {
        "name": "UI Goodies",
        "description": "Коллекция ресурсов UI/UX, включая цветовые палитры, иконки и инструменты.",
        "price": "Бесплатно"
      },
      "imagetotext": {
        "name": "Image to Text",
        "description": "OCR-технология для конвертации изображений в текст.",
        "price": "Бесплатно"
      },
      "coolors": {
        "name": "Coolors",
        "description": "Быстрый и удобный генератор цветовых палитр для дизайнеров и художников.",
        "price": "Бесплатно / Pro: 5$/месяц"
      },
      "htmlColorCodes": {
        "name": "HTML Color Codes",
        "description": "Инструмент для поиска и конвертации HTML-кодов цветов.",
        "price": "Бесплатно"
      },
      "pdf2docx": {
        "name": "PDF2DOCX",
        "description": "Онлайн-конвертер для преобразования PDF в редактируемые DOCX-файлы.",
        "price": "Бесплатно / Премиум"
      },
      "smodin": {
        "name": "Smodin",
        "description": "Инструмент с искусственным интеллектом для перефразирования и генерации текста.",
        "price": "Бесплатно / Pro: Разные тарифы"
      },
      "patorjk": {
        "name": "Patorjk",
        "description": "Генератор ASCII-текста и различные онлайн-инструменты для разработчиков.",
        "price": "Бесплатно"
      },
      "deepseek": {
        "name": "Deepseek",
        "description": "Продвинутый инструмент для поиска и анализа данных в сети.",
        "price": "Бесплатно / Pro: 15$/мес."
      },
      "vercelHosting": {
        "name": "Vercel Hosting",
        "description": "Современный облачный хостинг для фронтенд-приложений.",
        "price": "Бесплатно / Pro: от 20$/мес."
      }
    }
  }
}
